aabzel/trunk/source/microcontroller/stm32f415rg/stm32f415rg_const.h

#ifndef STM32F415RG_CONST_H
#define STM32F415RG_CONST_H

#include <stm32f415xx.h>

#include "macro_utils.h"

#define ADC_CHANNELS_COUNT 16
#define ADC_COUNT 3
#define AHB1_CLOCK_HZ SYS_FREQ
#define APB1_CLOCK_HZ (AHB1_CLOCK_HZ/4)
#define APB2_CLOCK_HZ (AHB1_CLOCK_HZ/2)
#define CAN_COUNT 2
#define CPU_MAX_HZ 168000000 
#define CRY_COUNT 1
#define DAC_CHANNELS_COUNT 2
#define DAC_COUNT 1
#define DMA_COUNT 2
#define DMA_STREAM_COUNT 8
#define GPIO_COUNT 51
#define I2C_COUNT 3
#define I2S_COUNT 2
#define LSI_FREQ 32000
#define MAX_IRQ_NUM FPU_IRQn
#define MCU_NAME "stm32f415rg"
#define MCU_PACKAGE  "LQFP64"
#define RAM_SIZE (128 * K_BYTES)
#define RAM_END (RAM_START + RAM_SIZE)
#define RAM_START 0x20000000
#define GPIO_PIN_MAX 15
#define ROM_START 0x08000000
#define ROM_SIZE (1024 * K_BYTES)
#define ROM_END (ROM_START + ROM_SIZE)
#define NOR_FLASH_START ROM_START
#define SDIO_COUNT 1
#define SPI_COUNT 3
#define SYS_FREQ 168000000
#define TIMER_COUNT 14
#define TRNG_COUNT 1
#define UART_COUNT 6
#define USB_COUNT 2

#define TIMER_MAX_COUNT (TIMER_COUNT+1)


#define NOR_FLASH_END (ROM_START+ROM_SIZE)


#endif /* STM32F415RG_CONST_H */
